export interface KatakanaGroup {
	[key: string]: string[];
}

export const katakanas = [
	'ア', 'イ', 'ウ', 'エ', 'オ',
	'カ', 'キ', 'ク', 'ケ', 'コ',
	'サ', 'シ', 'ス', 'セ', 'ソ',
	'タ', 'チ', 'ツ', 'テ', 'ト',
	'ナ', 'ニ', 'ヌ', 'ネ', 'ノ',
	'ハ', 'ヒ', 'フ', 'ヘ', 'ホ',
	'マ', 'ミ', 'ム', 'メ', 'モ',
	'ヤ', 'ユ', 'ヨ',
	'ラ', 'リ', 'ル', 'レ', 'ロ',
	'ワ', 'ヲ', 'ン'
];

export const katakanasInRomaji = [
	'a', 'i', 'u', 'e', 'o',
	'ka', 'ki', 'ku', 'ke', 'ko',
	'sa', 'shi', 'su', 'se', 'so',
	'ta', 'chi', 'tsu', 'te', 'to',
	'na', 'ni', 'nu', 'ne', 'no',
	'ha', 'hi', 'hu', 'he', 'ho',
	'ma', 'mi', 'mu', 'me', 'mo',
	'ya', 'yu', 'yo',
	'ra', 'ri', 'ru', 're', 'ro',
	'wa', 'wo', 'n'
];

export const katakanasGroup:KatakanaGroup = {
	a: ['ア', 'イ', 'ウ', 'エ', 'オ'],
	ka: ['カ', 'キ', 'ク', 'ケ', 'コ'],
	sa: ['サ', 'シ', 'ス', 'セ', 'ソ'],
	ta: ['タ', 'チ', 'ツ', 'テ', 'ト'],
	na: ['ナ', 'ニ', 'ヌ', 'ネ', 'ノ'],
	ha: ['ハ', 'ヒ', 'フ', 'ヘ', 'ホ'],
	ma: ['マ', 'ミ', 'ム', 'メ', 'モ'],
	ya: ['ヤ', 'ユ', 'ヨ'],
	ra: ['ラ', 'リ', 'ル', 'レ', 'ロ'],
	wa: ['ワ', 'ヲ', 'ン'],
};